.
├── .env
├── .gitattributes
├── .gitignore
├── FILES.txt
├── PROMPTS.md
├── README.md
├── com_apple_MobileAsset_UAF_FM_GenerativeModels
│   └── purpose_auto
│       ├── 03afaa26b16e50118fd624cbf8adaab6d29bf6bd.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 065239a77f3e7f496c49a0f92f1e6ac95f425a8c.asset
│       │   ├── AssetData
│       │   │   └── tokenizer
│       │   └── Info.plist
│       ├── 095ed9c357798e03a7b6d5f1bf8637455e84e911.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 256dfcc19eb64aabcd4b1b9298641410fbd04bda.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 2963ef627a58c652dd1e9f17a575a4c7cbbbea82.asset
│       │   ├── .AssetData
│       │   │   ├── System
│       │   │   │   └── Library
│       │   │   │       └── CoreServices
│       │   │   │           ├── RestoreVersion.plist
│       │   │   │           └── SystemVersion.plist
│       │   │   ├── metadata.json
│       │   │   └── model.bundle
│       │   │       └── H13G.bundle
│       │   │           ├── H13G.e5
│       │   │           ├── load_embeddings
│       │   │           │   └── load_embeddings_e5_minimal_cpu
│       │   │           │       ├── fragment.mil
│       │   │           │       └── weights.bin
│       │   │           ├── lora_16_extend_1024_16
│       │   │           │   ├── lora_16_extend_1024_16_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_1024_16_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_1024_64
│       │   │           │   ├── lora_16_extend_1024_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_1024_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_2048_16
│       │   │           │   ├── lora_16_extend_2048_16_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_2048_16_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_2048_64
│       │   │           │   ├── lora_16_extend_2048_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_2048_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_2048_8
│       │   │           │   ├── lora_16_extend_2048_8_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_2048_8_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_256_16
│       │   │           │   ├── lora_16_extend_256_16_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_256_16_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_256_64
│       │   │           │   ├── lora_16_extend_256_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_256_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_512_16
│       │   │           │   ├── lora_16_extend_512_16_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_512_16_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_512_64
│       │   │           │   ├── lora_16_extend_512_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_512_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_extend_512_8
│       │   │           │   ├── lora_16_extend_512_8_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_extend_512_8_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_prompt_opt_1024_64
│       │   │           │   ├── lora_16_prompt_opt_1024_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_prompt_opt_1024_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_prompt_opt_2048_64
│       │   │           │   ├── lora_16_prompt_opt_2048_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_prompt_opt_2048_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_prompt_opt_256_64
│       │   │           │   ├── lora_16_prompt_opt_256_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_prompt_opt_256_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_16_prompt_opt_512_64
│       │   │           │   ├── lora_16_prompt_opt_512_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_16_prompt_opt_512_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_32_extend_1024_64
│       │   │           │   ├── lora_32_extend_1024_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_32_extend_1024_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_32_extend_2048_64
│       │   │           │   ├── lora_32_extend_2048_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_32_extend_2048_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_32_extend_2048_8
│       │   │           │   ├── lora_32_extend_2048_8_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_32_extend_2048_8_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_32_extend_256_64
│       │   │           │   ├── lora_32_extend_256_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_32_extend_256_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_32_extend_512_64
│       │   │           │   ├── lora_32_extend_512_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_32_extend_512_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_32_extend_512_8
│       │   │           │   ├── lora_32_extend_512_8_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_32_extend_512_8_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_32_prompt_opt_256_64
│       │   │           │   ├── lora_32_prompt_opt_256_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_32_prompt_opt_256_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_8_extend_1024_64
│       │   │           │   ├── lora_8_extend_1024_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_8_extend_1024_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_8_extend_2048_64
│       │   │           │   ├── lora_8_extend_2048_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_8_extend_2048_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_8_extend_2048_8
│       │   │           │   ├── lora_8_extend_2048_8_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_8_extend_2048_8_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_8_extend_256_64
│       │   │           │   ├── lora_8_extend_256_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_8_extend_256_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── lora_8_extend_512_64
│       │   │           │   ├── lora_8_extend_512_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   ├── lora_8_extend_512_64_e5_minimal_cpu
│       │   │           │   │   └── fragment.mil
│       │   │           │   └── multiprocedure
│       │   │           │       └── model.hwx
│       │   │           ├── lora_8_extend_512_8
│       │   │           │   ├── lora_8_extend_512_8_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── lora_8_extend_512_8_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           └── lora_8_prompt_opt_256_64
│       │   │               ├── lora_8_prompt_opt_256_64_classic_cpu
│       │   │               │   ├── model.espresso.net
│       │   │               │   ├── model.espresso.shape
│       │   │               │   └── model.espresso.weights
│       │   │               └── lora_8_prompt_opt_256_64_e5_minimal_cpu
│       │   │                   └── fragment.mil
│       │   ├── AssetData
│       │   │   └── Restore
│       │   │       ├── BuildManifest.plist
│       │   │       ├── Firmware
│       │   │       │   ├── Manifests
│       │   │       │   │   └── restore
│       │   │       │   │       └── cryptex1
│       │   │       │   │           └── com.apple.MobileAsset.UAF.FM.GenerativeModels:com.apple.fm.language.instruct_3b.base.generic-H13g
│       │   │       │   │               └── apticket.mobileassetx86macosap.im4m
│       │   │       │   ├── UC_FM_LANGUAGE_INSTRUCT_3B_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.cryptex_info
│       │   │       │   ├── UC_FM_LANGUAGE_INSTRUCT_3B_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.integrity_catalog
│       │   │       │   ├── UC_FM_LANGUAGE_INSTRUCT_3B_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.root_hash
│       │   │       │   └── UC_FM_LANGUAGE_INSTRUCT_3B_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.trustcache
│       │   │       ├── Restore.plist
│       │   │       └── UC_FM_LANGUAGE_INSTRUCT_3B_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg
│       │   ├── Info.plist
│       │   └── SecureAssetData
│       │       ├── BuildManifest.plist
│       │       ├── SecureMobileAsset-Info.plist
│       │       ├── SecureMobileAsset.dmg
│       │       ├── SecureMobileAsset.integritycatalog
│       │       ├── SecureMobileAsset.root_hash
│       │       ├── SecureMobileAsset.trustcache
│       │       └── amai
│       │           ├── Cryptex1
│       │           │   └── Cryptex1,Ticket
│       │           ├── debug
│       │           │   ├── tss-request.plist
│       │           │   └── tss-response.plist
│       │           └── receipt.plist
│       ├── 2ca582fd431bb076dabc86d865fd07594b3efaed.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 2db17a12efa9c86460b35a1170d971c1942c80ed.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 2f8cc28dfc81d500f17854833ef89af440cad5db.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 32ad14bd3a19ff6fe5385f13b8bf997faae68e91.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 3616812d4222ed8164cd1bff07349e9d2f265b3e.asset
│       │   ├── .AssetData
│       │   │   ├── System
│       │   │   │   └── Library
│       │   │   │       └── CoreServices
│       │   │   │           ├── RestoreVersion.plist
│       │   │   │           └── SystemVersion.plist
│       │   │   ├── metadata.json
│       │   │   └── model.bundle
│       │   │       └── H13G.bundle
│       │   │           ├── H13G.e5
│       │   │           ├── extend_1024_64
│       │   │           │   ├── extend_1024_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── extend_1024_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── extend_2048_64
│       │   │           │   ├── extend_2048_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── extend_2048_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── extend_2048_8
│       │   │           │   ├── extend_2048_8_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   ├── extend_2048_8_e5_minimal_cpu
│       │   │           │   │   └── fragment.mil
│       │   │           │   └── multiprocedure
│       │   │           │       └── model.hwx
│       │   │           ├── extend_256_64
│       │   │           │   ├── extend_256_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── extend_256_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           ├── extend_512_64
│       │   │           │   ├── extend_512_64_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
│       │   │           │   │   └── model.espresso.weights
│       │   │           │   └── extend_512_64_e5_minimal_cpu
│       │   │           │       └── fragment.mil
│       │   │           └── load_embeddings
│       │   │               └── load_embeddings_e5_minimal_cpu
│       │   │                   ├── fragment.mil
│       │   │                   └── weights.bin
│       │   ├── AssetData
│       │   │   └── Restore
│       │   │       ├── BuildManifest.plist
│       │   │       ├── Firmware
│       │   │       │   ├── Manifests
│       │   │       │   │   └── restore
│       │   │       │   │       └── cryptex1
│       │   │       │   │           └── com.apple.MobileAsset.UAF.FM.GenerativeModels:com.apple.fm.language.safety_guardrail.base.generic-H13g
│       │   │       │   │               └── apticket.mobileassetx86macosap.im4m
│       │   │       │   ├── UC_FM_LANGUAGE_SAFETY_GUARDRAIL_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.cryptex_info
│       │   │       │   ├── UC_FM_LANGUAGE_SAFETY_GUARDRAIL_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.integrity_catalog
│       │   │       │   ├── UC_FM_LANGUAGE_SAFETY_GUARDRAIL_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.root_hash
│       │   │       │   └── UC_FM_LANGUAGE_SAFETY_GUARDRAIL_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg.trustcache
│       │   │       ├── Restore.plist
│       │   │       └── UC_FM_LANGUAGE_SAFETY_GUARDRAIL_BASE_GENERIC_GENERIC_H13G_Cryptex.dmg
│       │   ├── Info.plist
│       │   └── SecureAssetData
│       │       ├── BuildManifest.plist
│       │       ├── SecureMobileAsset-Info.plist
│       │       ├── SecureMobileAsset.dmg
│       │       ├── SecureMobileAsset.integritycatalog
│       │       ├── SecureMobileAsset.root_hash
│       │       ├── SecureMobileAsset.trustcache
│       │       └── amai
│       │           ├── Cryptex1
│       │           │   └── Cryptex1,Ticket
│       │           ├── debug
│       │           │   ├── tss-request.plist
│       │           │   └── tss-response.plist
│       │           └── receipt.plist
│       ├── 3abef39a566c66141e1a34dab9943f98ada01a39.asset
│       │   ├── AssetData
│       │   │   └── tokenizer
│       │   └── Info.plist
│       ├── 4b20b27e16294d9e36d6b4afbc4abc154afa5014.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 515977437f79f305052410adc80b1bac3655f3fa.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 5535c1b295022cc92fc704d93639953c3b4b2b69.asset
│       │   ├── .AssetData
│       │   │   ├── System
│       │   │   │   └── Library
│       │   │   │       └── CoreServices
│       │   │   │           ├── RestoreVersion.plist
│       │   │   │           └── SystemVersion.plist
│       │   │   ├── com.apple.fm.language.instruct_3b.autonaming_messages.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.concise_tone.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.friendly_tone.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.magic_rewrite.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.mail_reply.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.messages_reply.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.professional_tone.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.proofreading_review.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.summarization.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.urgency_classification.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   └── metadata.json
│       │   ├── AssetData
│       │   │   └── Restore
│       │   │       ├── BuildManifest.plist
│       │   │       ├── Firmware
│       │   │       │   ├── Manifests
│       │   │       │   │   └── restore
│       │   │       │   │       └── cryptex1
│       │   │       │   │           └── com.apple.MobileAsset.UAF.FM.GenerativeModels:com.apple.fm.language.instruct_3b.drafts.generic-H13g
│       │   │       │   │               └── apticket.mobileassetx86macosap.im4m
│       │   │       │   ├── UC_FM_LANGUAGE_INSTRUCT_3B_DRAFTS_GENERIC_GENERIC_H13G_Cryptex.dmg.cryptex_info
│       │   │       │   ├── UC_FM_LANGUAGE_INSTRUCT_3B_DRAFTS_GENERIC_GENERIC_H13G_Cryptex.dmg.integrity_catalog
│       │   │       │   ├── UC_FM_LANGUAGE_INSTRUCT_3B_DRAFTS_GENERIC_GENERIC_H13G_Cryptex.dmg.root_hash
│       │   │       │   └── UC_FM_LANGUAGE_INSTRUCT_3B_DRAFTS_GENERIC_GENERIC_H13G_Cryptex.dmg.trustcache
│       │   │       ├── Restore.plist
│       │   │       └── UC_FM_LANGUAGE_INSTRUCT_3B_DRAFTS_GENERIC_GENERIC_H13G_Cryptex.dmg
│       │   ├── Info.plist
│       │   └── SecureAssetData
│       │       ├── BuildManifest.plist
│       │       ├── SecureMobileAsset-Info.plist
│       │       ├── SecureMobileAsset.dmg
│       │       ├── SecureMobileAsset.integritycatalog
│       │       ├── SecureMobileAsset.root_hash
│       │       ├── SecureMobileAsset.trustcache
│       │       └── amai
│       │           ├── Cryptex1
│       │           │   └── Cryptex1,Ticket
│       │           ├── debug
│       │           │   ├── tss-request.plist
│       │           │   └── tss-response.plist
│       │           └── receipt.plist
│       ├── 5d48e58c05fcf115ae45248f6fd1435a70db2503.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 68780a452018c44098bb0e21c9c128051700a8d8.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 68ebe7a93b9c3f9c734b798f61fcefc6bfccc777.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 77457ff28bb83c8b17e78c3e05e4678507dd175d.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 832d95c7d6b5a817ae6eb95ba23b6be5f2a96d4d.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 89247375851dbe95c8f569ad6666d923d4db1ee7.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 895eef85098745225f15e925a58a0ae102835db5.asset
│       │   ├── AssetData
