.
├── .env
├── FILES.txt
├── PROMPTS.md
├── README.md
├── com_apple_MobileAsset_UAF_FM_GenerativeModels
│   └── purpose_auto
│       ├── 02da2d8b9b48b42dfc82bf8895886f354f5dc573.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 1248a939eb03aa21c16bd81e68d1d43a8bcd3cd3.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 125d1d3a3663c98e4d38bc4112795795ee5fe412.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 12e8a95ad1252f2905e539f48da6ed8290603fae.asset
│       │   ├── .AssetData
│       │   │   ├── System
│       │   │   │   └── Library
│       │   │   │       └── CoreServices
│       │   │   │           ├── RestoreVersion.plist
│       │   │   │           └── SystemVersion.plist
│       │   │   ├── com.apple.fm.language.instruct_3b.answer_synthesis.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.autonaming_messages.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.bullets_transform.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.concise_tone.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.factual_consistency_classifier.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.friendly_tone.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.magic_rewrite.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.mail_reply.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.messages_reply.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.professional_tone.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.proofreading_review.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.safety_guardrail.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.summarization.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.tables_transform.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.takeaways_transform.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.ui_previews.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   ├── com.apple.fm.language.instruct_3b.urgency_classification.draft
│       │   │   │   ├── metadata.json
│       │   │   │   ├── model.bundle
│       │   │   │   │   └── H13G.bundle
│       │   │   │   │       ├── H13G.e5
│       │   │   │   │       ├── extend_1024_64
│       │   │   │   │       │   ├── extend_1024_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_1024_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_64
│       │   │   │   │       │   ├── extend_2048_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_2048_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_2048_8
│       │   │   │   │       │   ├── extend_2048_8_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   ├── extend_2048_8_e5_minimal_cpu
│       │   │   │   │       │   │   └── fragment.mil
│       │   │   │   │       │   └── multiprocedure
│       │   │   │   │       │       └── model.hwx
│       │   │   │   │       ├── extend_256_64
│       │   │   │   │       │   ├── extend_256_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_256_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       ├── extend_512_64
│       │   │   │   │       │   ├── extend_512_64_classic_cpu
│       │   │   │   │       │   │   ├── model.espresso.net
│       │   │   │   │       │   │   ├── model.espresso.shape
│       │   │   │   │       │   │   └── model.espresso.weights
│       │   │   │   │       │   └── extend_512_64_e5_minimal_cpu
│       │   │   │   │       │       └── fragment.mil
│       │   │   │   │       └── load_embeddings
│       │   │   │   │           └── load_embeddings_e5_minimal_cpu
│       │   │   │   │               ├── fragment.mil
│       │   │   │   │               └── weights.bin
│       │   │   │   ├── model.mil
│       │   │   │   └── photon-multiproc-v3-9m-via-fmexport.bin
│       │   │   └── metadata.json
│       │   ├── AssetData
│       │   │   └── Restore
│       │   │       ├── BuildManifest.plist
│       │   │       ├── Firmware
│       │   │       │   ├── Manifests
│       │   │       │   │   └── restore
│       │   │       │   │       └── cryptex1
│       │   │       │   │           └── com.apple.MobileAsset.UAF.FM.GenerativeModels:com.apple.fm.language.instruct_3b.drafts.generic-H13g
│       │   │       │   │               └── apticket.mobileassetx86macosap.im4m
│       │   │       │   ├── UC_INSTRUCT_3B_DRAFTS_GENERIC_H13G_Cryptex.dmg.cryptex_info
│       │   │       │   ├── UC_INSTRUCT_3B_DRAFTS_GENERIC_H13G_Cryptex.dmg.integrity_catalog
│       │   │       │   ├── UC_INSTRUCT_3B_DRAFTS_GENERIC_H13G_Cryptex.dmg.root_hash
│       │   │       │   └── UC_INSTRUCT_3B_DRAFTS_GENERIC_H13G_Cryptex.dmg.trustcache
│       │   │       ├── Restore.plist
│       │   │       └── UC_INSTRUCT_3B_DRAFTS_GENERIC_H13G_Cryptex.dmg
│       │   ├── Info.plist
│       │   └── SecureAssetData
│       │       ├── BuildManifest.plist
│       │       ├── SecureMobileAsset-Info.plist
│       │       ├── SecureMobileAsset.dmg
│       │       ├── SecureMobileAsset.integritycatalog
│       │       ├── SecureMobileAsset.root_hash
│       │       ├── SecureMobileAsset.trustcache
│       │       └── amai
│       │           ├── Cryptex1
│       │           │   └── Cryptex1,Ticket
│       │           ├── debug
│       │           │   ├── tss-request.plist
│       │           │   └── tss-response.plist
│       │           └── receipt.plist
│       ├── 135ef0aea73908521060216cfef15cf598edf949.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 180d473dba621909e874d91220455c5a8fead40d.asset
│       │   ├── AssetData
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 1a3b93adc4632ed94f07a7c89609872c90c6dce6.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 21713ac6abc5a8837016f2603692030e11b335bc.asset
│       │   ├── AssetData
│       │   │   ├── lora.part.bin
│       │   │   └── metadata.json
│       │   └── Info.plist
│       ├── 2e90b26412bd6884bacff542e43c8876e281bb19.asset
│       │   ├── .AssetData
│       │   │   ├── System
│       │   │   │   └── Library
│       │   │   │       └── CoreServices
│       │   │   │           ├── RestoreVersion.plist
│       │   │   │           └── SystemVersion.plist
│       │   │   ├── metadata.json
│       │   │   └── model.bundle
│       │   │       └── H13G.bundle
│       │   │           ├── H13G.e5
│       │   │           ├── load_embeddings
│       │   │           │   └── load_embeddings_e5_minimal_cpu
│       │   │           │       ├── fragment.mil
│       │   │           │       └── weights.bin
│       │   │           ├── lora_16_extend_1024_16
│       │   │           │   ├── lora_16_extend_1024_16_classic_cpu
│       │   │           │   │   ├── model.espresso.net
│       │   │           │   │   ├── model.espresso.shape
